app/Http/Controllers/CommonLoginController.php

    public function authenticate(Request $request)
{
    $credentials = $request->validate([
        'email'    => ['required', 'email'],
        'password' => ['required', 'string'],
    ]);

    $user = User::where('email', $credentials['email'])->first();
---
select * from `users` where `email` = 'rahulpullur4@gmail.com' limit 1