app/Http/Controllers/RegistrationController.php

insert into `users` (`name`, `email`, `phone`, `password`, `role`, `membership_fee`, `payment_status`, `verification_status`, `status`, `updated_at`, `created_at`) values ('Ivan Barker', 'azmiyashiri22@gmail.com', '3094244062', null, 'mentor', 0, 'paid', 'pending', 'inactive', '2026-07-08 04:43:14', '2026-07-08 04:43:14')
---
    public function store(Request $request)
    {

        // Validate all fields
        $validated = $request->validate(
            array_merge(
                $this->getBaseValidationRules(),
                $this->getRoleValidationRules($request->role)
            )
        );

        try {

            DB::beginTransaction();

            $role = $validated['role'];

            $fee = $this->fees[$role];

            // Create User
            $user = User::create([

                'name' => $validated['name'],

                'email' => $validated['email'],

                'phone' => $validated['phone'] ?? null,

                // Password will be generated after admin approval
                'password' => null,

                'role' => $role,

                'membership_fee' => $fee,

                'payment_status' => $fee > 0 ? 'pending' : 'paid',

                'verification_status' => 'pending',

                'status' => 'inactive',


insert into `student_registrations` (`user_id`, `college_name`, `university`, `course`, `year`, `skills`, `resume`, `college_id_card`, `interested_domain`, `updated_at`, `created_at`) values (5, 'Stuart Stout', 'Consectetur volupta', 'Facere incididunt co', '2nd Year', 'Dolor vel alias alia', 'students/resumes/9joAE7URlVa9LJWXmKSHODgyU1MPdjfHULDAn9Po.pdf', 'students/id_cards/CGWP9NWw6vIp8vpq6cQQaDf9L0Jjwksz5UI17r8l.jpg', 'Iste qui consequatur', '2026-07-07 09:01:19', '2026-07-07 09:01:19')
insert into `employee_registrations` (`user_id`, `company_name`, `designation`, `experience_years`, `current_ctc`, `expected_ctc`, `skills`, `resume`, `linkedin`, `experience_proof`, `updated_at`, `created_at`) values (10, 'Nelson and Larson Trading', 'Natus exercitationem', '2011', '82', '56', 'Ipsa ut aliqua Har', null, 'https://www.syqodeba.biz', null, '2026-07-07 09:23:47', '2026-07-07 09:23:47')
---
    protected function storeRoleRegistration($role, $userId, Request $request, array $validated)
    {
        switch ($role) {

            case 'student':

                StudentRegistration::create([
                    'user_id' => $userId,
                    'college_name' => $validated['college_name'],
                    'university' => $validated['university'],
                    'course' => $validated['course'],
                    'year' => $validated['year'],
                    'skills' => $validated['skills'] ?? null,
                    'resume' => $request->hasFile('resume')
                        ? $request->file('resume')->store('students/resumes', 'public')
                        : null,
                    'college_id_card' => $request->hasFile('college_id_card')
                        ? $request->file('college_id_card')->store('students/id_cards', 'public')
                        : null,
                    'interested_domain' => $validated['interested_domain'] ?? null,
                ]);

                break;

            case 'employee':

                EmployeeRegistration::create([
                    'user_id' => $userId,
                    'company_name' => $validated['company_name'],
                    'designation' => $validated['designation'],
                    'experience_years' => $validated['experience_years'],
                    'current_ctc' => $validated['current_ctc'] ?? null,
                    'expected_ctc' => $validated['expected_ctc'] ?? null,
                    'skills' => $validated['skills'] ?? null,
                    'resume' => $request->hasFile('resume')
                        ? $request->file('resume')->store('employees/resumes', 'public')
                        : null,
                    'linkedin' => $validated['linkedin'] ?? null,
                    'experience_proof' => $request->hasFile('experience_proof')
                        ? $request->file('experience_proof')->store('employees/proofs', 'public')
                        : null,
                ]);

insert into `employer_registrations` (`user_id`, `company_name`, `gst_number`, `pan_number`, `company_address`, `company_size`, `industry`, `website`, `company_logo`, `company_documents`, `updated_at`, `created_at`) values (11, 'Bradford and Oneil LLC', '823', '792', 'Nobis quia deserunt', '51-200', 'Dicta optio reprehe', 'https://www.qyticef.co.uk', null, null, '2026-07-07 09:24:34', '2026-07-07 09:24:34')
---

            case 'employer':

                EmployerRegistration::create([
                    'user_id' => $userId,
                    'company_name' => $validated['company_name'],
                    'gst_number' => $validated['gst_number'] ?? null,
                    'pan_number' => $validated['pan_number'] ?? null,
                    'company_address' => $validated['company_address'],
                    'company_size' => $validated['company_size'] ?? null,
                    'industry' => $validated['industry'] ?? null,
                    'website' => $validated['website'] ?? null,
                    'company_logo' => $request->hasFile('company_logo')
                        ? $request->file('company_logo')->store('employers/logo', 'public')
                        : null,
                    'company_documents' => $request->hasFile('company_documents')
                        ? $request->file('company_documents')->store('employers/documents', 'public')
                        : null,
                ]);

insert into `freelancer_registrations` (`user_id`, `specialization`, `experience`, `hourly_rate`, `portfolio_link`, `skills`, `github`, `linkedin`, `availability`, `updated_at`, `created_at`) values (4, 'Molestiae cupiditate', '2008', '85', 'https://www.cuwi.org', 'Quis tempora labore', 'https://www.wasozetypo.org.uk', 'https://www.xefolokepefenep.in', 'Full-time', '2026-07-08 04:41:08', '2026-07-08 04:41:08')
---

            case 'freelancer':

                FreelancerRegistration::create([
                    'user_id' => $userId,
                    'specialization' => $validated['specialization'],
                    'experience' => $validated['experience'],
                    'hourly_rate' => $validated['hourly_rate'] ?? null,
                    'portfolio_link' => $validated['portfolio_link'] ?? null,
                    'skills' => $validated['skills'] ?? null,
                    'github' => $validated['github'] ?? null,
                    'linkedin' => $validated['linkedin'] ?? null,
                    'availability' => $validated['availability'] ?? null,
                ]);

insert into `investor_registrations` (`user_id`, `organization`, `investment_range`, `preferred_sectors`, `investment_stage`, `linkedin`, `website`, `bio`, `verification_document`, `updated_at`, `created_at`) values (12, 'Melton and Bradford Co', 'Under ₹5L', 'Voluptatem Possimus', 'Seed', 'https://www.rycahica.ca', 'https://www.poh.com.au', 'Optio anim eiusmod', null, '2026-07-07 09:25:09', '2026-07-07 09:25:09')
---

            case 'investor':

                InvestorRegistration::create([
                    'user_id' => $userId,
                    'organization' => $validated['organization'],
                    'investment_range' => $validated['investment_range'],
                    'preferred_sectors' => $validated['preferred_sectors'],
                    'investment_stage' => $validated['investment_stage'],
                    'linkedin' => $validated['linkedin'] ?? null,
                    'website' => $validated['website'] ?? null,
                    'bio' => $validated['bio'] ?? null,
                    'verification_document' => $request->hasFile('verification_document')
                        ? $request->file('verification_document')->store('investors/documents', 'public')
                        : null,
                ]);

insert into `mentor_registrations` (`user_id`, `company`, `designation`, `expertise`, `years_of_experience`, `availability`, `linkedin`, `bio`, `resume`, `updated_at`, `created_at`) values (6, 'Gilmore Duffy Traders', 'Quo nulla quisquam c', 'Reprehenderit fuga', '1992', 'Flexible', 'https://www.wolomutawula.us', 'Eum dolor accusantiu', null, '2026-07-08 04:43:14', '2026-07-08 04:43:14')
---

            case 'mentor':

                MentorRegistration::create([
                    'user_id' => $userId,
                    'company' => $validated['company'],
                    'designation' => $validated['designation'],
                    'expertise' => $validated['expertise'],
                    'years_of_experience' => $validated['years_of_experience'],
                    'availability' => $validated['availability'] ?? null,
                    'linkedin' => $validated['linkedin'] ?? null,
                    'bio' => $validated['bio'] ?? null,
                    'resume' => $request->hasFile('resume')
                        ? $request->file('resume')->store('mentors/resumes', 'public')
                        : null,
                ]);