app/Http/Controllers/Admin/RegistrationApprovalController.php

select * from `users` where `verification_status` = 'pending' and `role` != 'admin' order by `created_at` desc limit 10 offset 0
select count(*) as `aggregate` from `users` where `verification_status` = 'pending' and `role` != 'admin'
---
     public function index(Request $request)
    {
        $query = User::where('verification_status', 'pending')
            ->where('role', '!=', 'admin')
            ->with([
                'studentRegistration',
                'employeeRegistration',
                'employerRegistration',
                'freelancerRegistration',
                'investorRegistration',
                'mentorRegistration',
            ]);

        if ($request->filled('role')) {
            $query->where('role', $request->role);
        }

        $users = $query->latest()->paginate(10)->withQueryString();

select * from `users` where `users`.`id` = '6' limit 1
update `users` set `password` = '$2y$12$NduafEds4w6QFapilVLvJ.vuqHQvWQxnf7GDOyCBzR/9DHfHPuA.2', `verification_status` = 'approved', `status` = 'active', `users`.`updated_at` = '2026-07-08 08:31:29' where `id` = 6
---
    public function approve($id)
    {
        $user = User::findOrFail($id);

        // Generate a secure random plaintext password
        $plainPassword = Str::password(12); // requires Laravel 9+; see note below if unavailable

        $user->update([
            'verification_status' => 'approved',
            'status'               => 'active',
            'password'             => Hash::make($plainPassword),
        ]);